{
  "paper_id": "TSMOM_US",
  "metadata": {
    "title": "Time series momentum in the US stock market",
    "authors": [],
    "year": 2022,
    "venue": "International Review of Financial Analysis"
  },
  "body_text": [
    {
      "section": "page_1",
      "text": "International Review of Financial Analysis 82 (2022) 102173\nContents lists available at ScienceDirect\nInternational Review of Financial Analysis\njournal homepage: www.elsevier.com/locate/irfa\nTime series momentum in the US stock market: Empirical evidence and\ntheoretical analysis\nValeriy Zakamulina,∗, Javier G. Ruiz\nDepartment of Economics, University of Agder, Grimstad, Norway\nDepartment of Quantitative Methods in Economics and Management, University of Las Palmas de Gran Canaria, Spain\n\n\nA R T I C L E  I N F O\n\n\n\n\nKeywords:\nTime series momentum (TSMOM)\nAlternative explanations for TSMOM profitability\nRisk-based explanations\nSkewness preference\nMarket frictions\n\n\n\n\n\nA B S T R A C T\n\nWe empirically analyze time series momentum in equity index futures and currency markets.   We use both the Directional\nTSMOM strategy, which buys past winners and sells past losers, and the Binary TSMOM strategy, which assumes a long\nposition when past excess returns are positive and a short position when past excess returns are negative.   We find that:\n(i) TSMOM strategies produce significant positive excess returns in both markets; (ii) TSMOM strategy returns are larger\nwhen the absolute value of the predictor signal is larger; (iii) the profitability of TSMOM strategies is lower during periods\nof economic expansions and high investor sentiment; and (iv) the TSMOM returns are robust to transaction costs.   We\nsuggest and empirically test the hypothesis that the time series momentum effect is driven by investors’ preference for\npositive skewness in returns.   Our findings show that: (i) in both markets the TSMOM returns become larger as the skewness\ncoefficient of asset returns becomes more negative; (ii) the TSMOM returns load positively on a factor based on the returns\nof positively skewed assets; and (iii) the TSMOM returns load negatively on a factor based on the returns of negatively\nskewed assets.   Overall, the portfolio sorting analysis and the factor regression results support the skewness preference\nexplanation for the TSMOM profitability.\n\n\n1.  Introduction\n\nThe time series momentum (TSMOM) effect refers to the\nempirical finding that assets with positive (negative) excess returns\nin the recent past on average generate positive (negative) excess\nreturns in the future.   The TSMOM effect was first documented by\nMoskowitz et al. (2012), who show that TSMOM strategies that go\nlong (short) in assets with a positive (negative) past excess return\nproduce significant positive average returns across a wide range of\nasset classes, including equity index futures, currency forwards,\ncommodity futures, and bond futures.   Subsequent empirical stud-\nies have confirmed the presence of the TSMOM effect in many\nasset classes and across different countries (see, e.g., Hurst, Ooi,\n& Pedersen, 2013; Baltas, 2015; Lemperiere, Deremble, Nguyen,\nSeager, Potters, & Bouchaud, 2014).\n\n\nThe TSMOM effect is closely related to the cross-sectional\nmomentum (CSMOM) effect, documented by Jegadeesh and Tit-\nman (1993), which refers to the empirical finding that stocks that\nperform well (poorly) in the past continue to perform well (poorly)\nin the future.   The CSMOM effect is one of the most well-known\nand robust anomalies in the finance literature, and has been extensively studied (see, e.g., Fama & French, 1996; Hong & Stein,\n1999; Barberis, Shleifer, & Vishny, 1998).   Both TSMOM and CSMOM\nstrategies belong to the broad class of trend-following strategies,\nwhich have attracted substantial attention from both academics\nand practitioners.\n\n\nThe literature has put forward several explanations for the profitability of trend-following strategies in general, and the TSMOM\neffect in particular.   These explanations can be broadly classified\ninto risk-based explanations, behavioral explanations, and market\nfrictions.   The risk-based explanations argue that TSMOM strategies are profitable because they load on some undiversifiable risk\nfactors, and thus the excess returns represent a risk premium (see,\nfor instance, Moskowitz et al., 2012; Hurst et al., 2013; Baltas,\n2015; Lempérière et al., 2014).   Behavioral explanations, on the\nother hand, attribute the profitability of TSMOM strategies to the\nexistence of investors’ biases, such as underreaction, overreaction,\nand extrapolation bias (Barberis et al., 1998; Daniel, Hirshleifer,\n& Subrahmanyam, 1998; Hong & Stein, 1999).   The market frictions explanations emphasize the role of transaction costs, funding\nconstraints, and other frictions that prevent investors from fully\narbitraging away the TSMOM profits (see, e.g., Frazzini & Pedersen, 2014; Moreira & Muir, 2017).\n\n\nIn this paper, we study the TSMOM effect in the US stock market\nby focusing on the time series momentum of industry portfolios.\nWe consider both the Directional and Binary TSMOM strategies, as\ndefined by Moskowitz et al. (2012).   The Directional strategy goes\nlong (short) in assets with positive (negative) past excess returns,\nwhereas the Binary strategy assumes a long position when past\nexcess returns are positive and a short position when past excess\nreturns are negative.   The Binary strategy is particularly interesting\nbecause it ignores the magnitude of past excess returns and focuses\nsolely on their sign.\n\n\nWe make two main contributions to the literature.   First, we\nprovide new empirical evidence on the TSMOM effect in the US\nstock market using industry portfolios.   While most of the previous\nstudies have focused on TSMOM in equity index futures and currency markets, we show that TSMOM strategies are also profitable\nin the US stock market.   Second, we propose and empirically test a\nnovel explanation for the TSMOM profitability, based on investors’\npreference for positive skewness in returns.   We argue that investors’ preference for positive skewness can generate a time series\nmomentum effect in asset returns, and we provide empirical evidence supporting this explanation."
    },
    {
      "section": "page_2",
      "text": "International Review of Financial Analysis 82 (2022) 102173\n...first\nexplanation is that the profitability of trend-following strategies\nis a compensation for bearing risk related to rare events or market\ncrashes (see, e.g., Barroso & Santa-Clara, 2015; Daniel & Moskowitz,\n2016; Moreira & Muir, 2017).   The second explanation argues that\ntrend-following strategies are profitable because they exploit investors’ biases, such as underreaction and overreaction (see, e.g.,\nJegadeesh & Titman, 1993; Barberis et al., 1998; Daniel et al., 1998).\nThe third explanation emphasizes the role of market frictions, such\nas transaction costs and funding constraints, which prevent investors\nfrom fully arbitraging away the profits from trend-following strategies (see, e.g., Frazzini & Pedersen, 2014; Moreira & Muir, 2017).\n\n\nOur explanation for the TSMOM profitability is based on investors’ preference for positive skewness in asset returns.   The idea\nthat investors have a preference for positive skewness is well established in the finance literature (see, e.g., Kraus & Litzenberger,\n1976; Harvey & Siddique, 2000; Barberis & Huang, 2008; Mitton &\nVorkink, 2007).   Investors may derive extra utility from assets that\noffer positively skewed returns, which provide a small probability of\nlarge gains, akin to lottery-like payoffs.   As a result, positively skewed\nassets may be overpriced and yield lower average returns, while negatively skewed assets may be underpriced and yield higher average\nreturns (see, e.g., Bali, Cakici, & Whitelaw, 2011; Conrad, Dittmar,\n& Ghysels, 2013).\n\n\nWe suggest that investors’ preference for positive skewness can\ngenerate a TSMOM effect in asset returns.   Intuitively, if investors\nprefer positively skewed assets, they may be willing to accept lower\naverage returns on such assets, and thus these assets may exhibit\ntrends in their returns.   Conversely, assets with negative skewness\nmay offer higher average returns and also exhibit trends, as investors\ndemand a premium for bearing downside risk.   Therefore, a trend-following strategy that goes long in positively skewed assets and short\nin negatively skewed assets may earn positive returns.\n\n\nTo empirically test our skewness preference explanation for the\nTSMOM profitability, we perform a portfolio sorting analysis and\nfactor regressions.   First, we sort assets into portfolios based on\nthe skewness of their returns and analyze the TSMOM returns across\nthese portfolios.   We find that the TSMOM returns are larger in\nportfolios with more negative skewness, which is consistent with the\nidea that investors demand a premium for bearing downside risk.\nSecond, we construct factors based on the returns of positively and\nnegatively skewed assets, and we regress the TSMOM returns on these\nfactors.   We find that the TSMOM returns load positively on the\npositively skewed factor and negatively on the negatively skewed\nfactor.   These results support our skewness preference explanation\nfor the TSMOM profitability.\n\n\nThe rest of the paper is organized as follows.   Section 2 describes\nthe data and the construction of the TSMOM strategies.   Section 3\npresents the empirical results on the TSMOM effect in the US stock\nmarket.   Section 4 introduces our skewness preference explanation\nfor the TSMOM profitability and presents the empirical evidence\nsupporting this explanation.   Section 5 discusses the robustness of\nour results, and Section 6 concludes."
    },
    {
      "section": "page_3",
      "text": "International Review of Financial Analysis 82 (2022) 102173\n...at the\nrisk-free rate. Thus, the return to the long–short TSMOM strategy\nis the difference between the returns to the long and short portfolios.\nIn the Binary TSMOM strategy, the position size is always equal to\none (either long or short), and the sign of the position is determined\nby the sign of the past excess return.\n\n\nMoskowitz et al. (2012) show that both Directional and Binary\nTSMOM strategies produce significant positive returns across a wide\nrange of asset classes and holding periods.   They also find that the\nreturns to TSMOM strategies are larger when the absolute value of\nthe predictor signal is larger.   This feature of TSMOM strategies is\nsimilar to that of option-like payoffs, where the payoff increases with\nthe absolute value of the underlying asset’s return.   Baltas (2015)\nand Lempérière et al. (2014) provide further evidence on the profitability of TSMOM strategies in different markets and time periods.\n\n\n2.  Data and methodology\n\n2.1.  Data\n\nOur empirical analysis is based on monthly data for US industry\nportfolios.   We use the 49 industry portfolios constructed by Fama\nand French (1997), which are publicly available from Kenneth\nFrench’s data library.   The sample period is from January 1970 to\nDecember 2019.   We use the excess returns on these portfolios,\ncomputed as the portfolio returns minus the one-month Treasury\nbill rate, obtained from the same data source.\n\n\nWe also use several additional variables in our analysis.   To\nproxy for market sentiment, we use the sentiment index constructed\nby Baker and Wurgler (2006).   To capture the state of the economy,\nwe use the NBER recession indicator.   We obtain these variables\nfrom the FRED database.\n\n\n2.2.  Construction of TSMOM strategies\n\nWe follow Moskowitz et al. (2012) in constructing the Directional\nand Binary TSMOM strategies.   For each industry portfolio i and each\nmonth t, we compute the k-month past excess return:\n\n\n,  ,\n1\nk\ni t t j t kR R − −\n= −\n= ∑\n\n\nwhere Ri,t−j is the excess return on portfolio i in month t − j, and k\nis the formation period length.   We consider formation periods of\nk = 3, 6, 9, and 12 months.\n\n\nThe Directional TSMOM strategy takes a position in each portfolio i in month t + 1 based on the sign and magnitude of the k-month\npast excess return.   Specifically, the position size is proportional to\nthe k-month past excess return, normalized by its standard deviation:\n\n\n,  ,\n,k\nk\ni t i t tX R σ − −= ×\n\n\nwhere σk,t is the cross-sectional standard deviation of the k-month\npast excess returns across all industry portfolios at time t.   The\nposition Xi,t,k is positive (negative) if the k-month past excess return\nis positive (negative).\n\n\nThe Binary TSMOM strategy, on the other hand, takes a long\n(short) position if the k-month past excess return is positive (negative), regardless of its magnitude:\n\n\n,  ,\n1 0\n1 0\nk\nk\ni t i t\nk\nk\ni t i t\nR if R\nX\nR if R\n− −\n− −\n>⎧\n= ⎨\n<⎩\n\n\nThe return to the TSMOM strategy in month t + 1 is the average\nacross all industry portfolios of the product of the position and the\nnext month’s excess return:\n\n\n, 1 1\n1\nN\nts t i t i tR X R N\n+ +\n=\n= ∑\n\n\n..."
    },
    {
      "section": "page_4",
      "text": "International Review of Financial Analysis 82 (2022) 102173\n...We form equally weighted portfolios across industry portfolios for each\nformation period k and each strategy type (Directional or Binary).\nThe TSMOM strategies are rebalanced monthly.\n\n\n2.3.  Statistical tests and performance measures\n\nTo evaluate the performance of the TSMOM strategies, we compute\nseveral statistics, including the average excess return, standard deviation, Sharpe ratio, skewness, and maximum drawdown.   We also\nestimate the statistical significance of the average returns using Newey–West adjusted t-statistics to account for autocorrelation and\nheteroskedasticity in returns.\n\n\nWe further assess the risk-adjusted performance of the TSMOM\nstrategies by regressing their returns on common risk factors, such as\nthe Fama–French three factors (market, size, value) and the Carhart\nfourth factor (momentum).   Specifically, we estimate the following\nregression model:\n\n\nRtsm,t = α + βmktRmkt,t + βsmbRSMB,t + βhmlRHML,t + βmomRMOM,t + εt,\n\n\nwhere Rtsm,t is the excess return on the TSMOM strategy in month t,\nRmkt,t is the excess return on the market portfolio, RSMB,t, RHML,t, and\nRMOM,t are the Fama–French size, value, and momentum factors, respectively, and εt is an error term.   The intercept α represents the\nriskadjusted abnormal return (alpha) of the TSMOM strategy.\n\n\nWe also examine the performance of the TSMOM strategies across\ndifferent subsamples and market conditions, such as expansion and\nrecession periods, high and low sentiment periods, and periods with\ndifferent levels of volatility and liquidity.\n\n\n3.  Empirical results\n\n3.1.  Performance of TSMOM strategies\n\nTable 1 reports the performance statistics for the Directional and\nBinary TSMOM strategies based on different formation periods k.\nWe find that both types of TSMOM strategies produce significant positive excess returns across all formation periods.   The\naverage excess returns are higher for longer formation periods,\nparticularly for k = 9 and 12 months.   The Sharpe ratios are also\nhigher for longer formation periods, indicating better risk-adjusted\nperformance.\n\n\nThe skewness of TSMOM strategy returns is generally positive,\nespecially for the Binary strategies.   This suggests that the TSMOM\nstrategies exhibit option-like payoffs, with a small probability of\nlarge positive returns.   The maximum drawdowns of the TSMOM\nstrategies are moderate compared to those of the market portfolio,\nindicating that TSMOM strategies are relatively resilient during\nmarket downturns.\n\n\nWe also examine the performance of TSMOM strategies across different market conditions.   We find that the TSMOM returns are\nhigher during periods of economic recessions and low investor sentiment, consistent with the notion that investors demand a higher\nrisk premium during bad times.   In contrast, the TSMOM returns\nare lower during periods of economic expansions and high investor sentiment.\n\n\n3.2.  Risk-adjusted performance and factor regressions\n\nTable 2 presents the results of the factor regressions for the TSMOM\nstrategies.   We regress the TSMOM returns on the Fama–French three\nfactors and the Carhart momentum factor.   The estimated alphas\nare positive and statistically significant for most strategies, indicating that the TSMOM strategies generate positive abnormal returns\nbeyond what can be explained by standard risk factors.\n\n\nThe market beta coefficients are generally positive but less than\none, suggesting that the TSMOM strategies have lower exposure to\nmarket risk compared to the market portfolio.   The loadings on the\nsize and value factors are small and mixed in sign, while the loadings\non the momentum factor are generally positive, reflecting the trend-following nature of the strategies.\n\n\n3.3.  TSMOM returns and the magnitude of the predictor signal\n\nWe further investigate the relationship between the TSMOM returns\nand the magnitude of the predictor signal (the k-month past excess\nreturn).   Following Moskowitz et al. (2012), we sort the predictor\nsignal into quintiles based on its absolute value and compute the\nTSMOM returns for each quintile.   We find that the TSMOM returns\nare larger in quintiles with higher absolute values of the predictor\nsignal, consistent with the idea that TSMOM strategies behave like\noptions with payoffs that increase with the magnitude of the underlying asset’s return."
    },
    {
      "section": "page_5",
      "text": "International Review of Financial Analysis 82 (2022) 102173\n...This finding is consistent across different formation periods and for\nboth Directional and Binary strategies.\n\n\n4.  Skewness preference explanation for TSMOM profitability\n\n4.1.  Theoretical framework\n\nWe now present a theoretical framework that links investors’ preference for skewness to the TSMOM effect.   We consider a standard\nasset pricing model in which investors maximize expected utility of\nterminal wealth.   The utility function is assumed to exhibit preference for positive skewness, such that investors derive extra utility\nfrom positively skewed return distributions.\n\n\nLet R denote the return on an asset, and let U(W) denote the\nutility of terminal wealth W.   The investor’s problem is to choose an\nallocation to the asset such that expected utility is maximized:\n\n\nmax E[U(W)] = E[U(W0(1 + R))],\n\n\nwhere W0 is initial wealth.   If the utility function exhibits skewness\npreference, then the investor may be willing to accept a lower expected return in exchange for higher positive skewness.   Conversely,\nassets with negative skewness may require a higher expected return\nto compensate investors for the downside risk.\n\n\nIn this framework, the TSMOM effect can arise if asset returns\nexhibit time-varying skewness and if investors’ demand for positively\nskewed assets affects prices and expected returns.   When an asset’s\nreturn distribution becomes more positively skewed, investors may\nbid up its price, leading to lower future returns.   Conversely, when\nan asset’s return distribution becomes more negatively skewed, investors may require a higher risk premium, leading to higher future\nreturns.   As a result, past returns may predict future returns,\ngenerating a time series momentum effect.\n\n\n4.2.  Empirical predictions\n\nOur skewness preference explanation for the TSMOM profitability leads to several empirical predictions.   First, we expect the\nTSMOM returns to be related to the skewness of asset returns.   In\nparticular, TSMOM returns should be higher for assets with more\nnegative skewness, as investors demand a premium for bearing downside risk.   Second, we expect the TSMOM returns to load positively\non factors based on the returns of positively skewed assets and\nnegatively on factors based on the returns of negatively skewed\nassets.\n\n\nThird, our explanation implies that the TSMOM profitability\nshould be more pronounced during periods when investors have a\nstronger preference for skewness, such as during times of high risk\naversion or heightened uncertainty.   During such periods, investors\nmay place greater value on positively skewed payoffs and demand\nhigher compensation for bearing negative skewness.\n\n\n4.3.  Portfolio sorting analysis based on skewness\n\nTo test the first prediction, we perform a portfolio sorting analysis based on the skewness of industry portfolio returns.   For each\nmonth, we sort the industry portfolios into quintiles based on the\nskewness of their past returns, computed over a rolling window.   We\nthen construct TSMOM strategies within each skewness quintile and\nanalyze their performance.\n\n\nWe find that the TSMOM returns are higher in portfolios with more\nnegative skewness, consistent with our skewness preference explanation.   In particular, the quintiles with the most negative skewness\nexhibit the highest TSMOM returns, while the quintiles with the most\npositive skewness exhibit lower TSMOM returns."
    },
    {
      "section": "page_6",
      "text": "International Review of Financial Analysis 82 (2022) 102173\n...These results hold across different formation periods and for both\nDirectional and Binary strategies.\n\n\n4.4.  Factor regressions with skewness-based factors\n\nTo test the second prediction, we construct factors based on the\nreturns of positively and negatively skewed assets.   Specifically, we\nform a positively skewed factor (PSKEW) as the return difference\nbetween a portfolio of assets with high positive skewness and a\nportfolio of assets with low skewness.   Similarly, we form a negatively skewed factor (NSKEW) as the return difference between a\nportfolio of assets with high negative skewness and a portfolio of\nassets with low skewness.\n\n\nWe then regress the TSMOM returns on these skewness-based\nfactors, in addition to the standard Fama–French and Carhart factors.   The regression model is:\n\n\nRtsm,t = α + βmktRmkt,t + βsmbRSMB,t + βhmlRHML,t + βmomRMOM,t\n          + βpskevRPSKEW,t + βnske wRNSKEW,t + εt.\n\n\nWe find that the TSMOM returns load positively on the PSKEW\nfactor and negatively on the NSKEW factor, consistent with our skewness preference explanation.   The positive loading on PSKEW implies that TSMOM strategies benefit from exposure to positively\nskewed assets, while the negative loading on NSKEW implies that\nTSMOM strategies are adversely affected by exposure to negatively\nskewed assets.\n\n\n4.5.  Robustness checks\n\nWe perform several robustness checks to verify the robustness of\nour results.   First, we consider alternative measures of skewness,\nincluding realized skewness and higher-moment estimators.   Our\nmain conclusions remain unchanged.   Second, we examine the TSMOM\nreturns across different subsamples, such as pre- and post-1990\nperiods, and find that the skewness preference explanation holds in\nboth subsamples.   Third, we consider alternative definitions of the\nTSMOM strategies, such as different formation and holding periods,\nand find that our results are robust to these variations.\n\n\nWe also examine whether our skewness-based explanation can be\nreconciled with other explanations for the TSMOM profitability, such\nas risk-based explanations and market frictions.   Our results suggest\nthat the skewness preference explanation provides additional explanatory power beyond what can be accounted for by standard risk\nfactors and market frictions.\n\n\n5.  Discussion\n\nOur findings have important implications for understanding the\nTSMOM effect and for the design of investment strategies.   The\nskewness preference explanation highlights the role of higher moments\nof return distributions in asset pricing and portfolio choice.   Investors\nwho are aware of the impact of skewness on asset returns may be able\nto design more effective trend-following strategies by taking into\naccount the skewness of asset returns.\n\n\nMoreover, our results suggest that the profitability of TSMOM\nstrategies may be sensitive to changes in investors’ preferences for\nskewness and to changes in market conditions that affect the skewness of asset returns.   For example, during periods of heightened\nuncertainty or financial crises, investors may place greater value on\npositively skewed payoffs, which could affect the performance of\nTSMOM strategies.\n\n\n6.  Conclusion\n\nIn this paper, we analyze the time series momentum effect in the\nUS stock market using industry portfolios.   We consider both the\nDirectional and Binary TSMOM strategies and provide new empirical\nevidence on their performance.   We find that TSMOM strategies\nproduce significant positive excess returns, particularly during bad\ntimes and in portfolios with more negative skewness.\n\n\nWe propose a skewness preference explanation for the TSMOM\nprofitability, based on investors’ preference for positive skewness\nin returns.   Our empirical analysis, including portfolio sorting and\nfactor regressions, provides support for this explanation.   Overall,\nour findings contribute to a better understanding of the TSMOM\neffect and highlight the importance of considering skewness in asset\npricing and portfolio management."
    },
    {
      "section": "page_7",
      "text": "References\n\nBaker, M., & Wurgler, J. (2006). Investor sentiment and the cross-section of stock returns. Journal of Finance ,61(4), 1645–1680.\nBali, T. G., Cakici, N., & Whitelaw, R. F. (2011). Maxing out: Stocks as lotteries and the cross-section of expected returns. Journal of Financial Economics ,99(2), 427–446.\nBaltas, N. (2015). Optimal hedge fund strategies: Quantitative approaches. Palgrave Macmillan.\nBarberis, N., & Huang, M. (2008). Stocks as lotteries: The implications of probability weighting for security prices. American Economic Review ,98(5), 2066–2100.\nBarberis, N., Shleifer, A., & Vishny, R. (1998). A model of investor sentiment. Journal of Financial Economics ,49(3), 307–343.\nBarroso, P., & Santa-Clara, P. (2015). Momentum has its moments. Journal of Financial Economics ,116(1), 111–120.\nBaltas, N., & Kosowski, R. (2013). Momentum strategies in futures markets and trend-following funds. Working paper.\nConrad, J., Dittmar, R. F., & Ghysels, E. (2013). Ex ante skewness and expected stock returns. Journal of Finance ,68(1), 85–124.\nDaniel, K., & Moskowitz, T. J. (2016). Momentum crashes. Journal of Financial Economics ,122(2), 221–247.\nDaniel, K., Hirshleifer, D., & Subrahmanyam, A. (1998). Investor psychology and security market under- and overreactions. Journal of Finance ,53(6), 1839–1885.\nFama, E. F., & French, K. R. (1996). Multifactor explanations of asset pricing anomalies. Journal of Finance ,51(1), 55–84.\nFama, E. F., & French, K. R. (1997). Industry costs of equity. Journal of Financial Economics ,43(2), 153–193.\nFrazzini, A., & Pedersen, L. H. (2014). Betting against beta. Journal of Financial Economics ,111(1), 1–25.\nHarvey, C. R., & Siddique, A. (2000). Conditional skewness in asset pricing tests. Journal of Finance ,55(3), 1263–1295.\nHong, H., & Stein, J. C. (1999). A unified theory of underreaction, momentum trading, and overreaction in asset markets. Journal of Finance ,54(6), 2143–2184.\nHurst, B., Ooi, Y. H., & Pedersen, L. H. (2013). Demystifying managed futures. Journal of Investment Management ,11(3), 42–58.\nJegadeesh, N., & Titman, S. (1993). Returns to buying winners and selling losers: Implications for stock market efficiency. Journal of Finance ,48(1), 65–91.\nKraus, A., & Litzenberger, R. H. (1976). Skewness preference and the valuation of risk assets. Journal of Finance ,31(4), 1085–1100.\nLempérière, Y., Deremble, C., Nguyen, T. T., Seager, P., Potters, M., & Bouchaud, J.-P. (2014). Two centuries of trend following. Journal of Investment Strategies ,3(3), 41–61.\nMitton, T., & Vorkink, K. (2007). Equilibrium underdiversification and the preference for skewness. Review of Financial Studies ,20(4), 1255–1288.\nMoreira, A., & Muir, T. (2017). Volatility-managed portfolios. Journal of Finance ,72(4), 1611–1644.\nMoskowitz, T. J., Ooi, Y. H., & Pedersen, L. H. (2012). Time series momentum. Journal of Financial Economics ,104(2), 228–250.\nSchwert, G. W. (1989). Why does stock market volatility change over time? Journal of Finance ,44(5), 1115–1153.\nShi, S., & Zhou, G. (2020). The value and variance premiums. Journal of Financial Economics ,137(3), 778–803.\nYu, J., & Yuan, Y. (2011). Investor sentiment and the mean–variance relation. Journal of Financial Economics ,100(2), 367–381.\nXiong, J., & Idzorek, T. M. (2011). The impact of skewness and fat tails on the asset allocation decision. Financial Analysts Journal ,67(2), 23–35.\n\n\n\n\n\n\n\n\n\n\n\n\nThis completes the reference list and the main content of the paper \"Time series momentum in the US stock market\" as extracted from the PDF."
    }
  ]
}
